In [27]:
## connect to and sqlite database
import sqlite3
connection = sqlite3.connect('test.db')
connection

In [28]:
cursor = connection.cursor()

In [29]:
cursor.execute('''
CREATE TABLE IF NOT EXISTS employees(
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    age INTEGER,
    department TEXT
)
''')
# commit the changes 
connection.commit()

In [30]:
cursor.execute('''
  select*from employees
''')

In [31]:
# Delete all existing data
cursor.execute("DELETE FROM employees")
connection.commit()

# Insert data only once
cursor.execute("INSERT INTO employees(name,age,department) VALUES('karan',20,'data science')")
cursor.execute("INSERT INTO employees(name,age,department) VALUES('mayank',21,'data science')")
connection.commit()

# Query and print
cursor.execute("SELECT * FROM employees")
rows = cursor.fetchall()

for row in rows:
    print(row)

(1, 'karan', 20, 'data science')
(2, 'mayank', 21, 'data science')

In [32]:
# # Get only the latest 2 rows
# cursor.execute("SELECT * FROM employees ORDER BY id DESC LIMIT 2")
# rows = cursor.fetchall()

# # Print them using loop
# for row in rows:
#     print(row)

In [33]:
# update the data in table 
cursor.execute('''
update employees
set age = 21
where name="mayank"
''')
# changes the commits
connection.commit()

In [34]:
# Get only the latest 2 rows
cursor.execute("SELECT * FROM employees ORDER BY id DESC LIMIT 2")
rows = cursor.fetchall()

# Print them using loop
for row in rows:
    print(row)

(2, 'mayank', 21, 'data science')
(1, 'karan', 20, 'data science')

In [ ]:
## delete the data from table 
cursor.execute('''s
Delete from employees 
    where name = 'mayank'
''')
connection.commit()

In [36]:
# Get only the latest 2 rows
cursor.execute("SELECT * FROM employees ORDER BY id DESC LIMIT 2")
rows = cursor.fetchall()

# Print them using loop
for row in rows:
    print(row)

(1, 'karan', 20, 'data science')

In [42]:
# working with sales data 
connection = sqlite3.connect('sales_data.db')
cursor = connection.cursor()

# Drop existing table if it exists
cursor.execute("DROP TABLE IF EXISTS sales")
connection.commit()

# Create fresh table with all columns
cursor.execute("""
create table sales(
    id INTEGER PRIMARY KEY,
    date TEXT NOT NULL,
    product TEXT NOT NULL,
    sales TEXT,
    region TEXT
)
""")

## insert data into sales table 
sales_data = [
    ('11-04-2023','product1',100,'lucknow'),
    ('12-04-2023','product2',200,'delhi'),
    ('13-04-2023','product3',300,'ghaziabad'),
    ('14-04-2023','product4',400,'kanpur'),
    ('15-04-2023','product5',500,'meerut')
]

## to print many line 
cursor.executemany('''
insert into sales(date,product,sales,region) 
                   values(?,?,?,?)
''',sales_data)

connection.commit()

In [44]:
## query data from sales table
cursor.execute("SELECT*FROM sales")
rows = cursor.fetchall()

## print queried data 
for row in rows:
    print(row)

(1, '11-04-2023', 'product1', '100', 'lucknow')
(2, '12-04-2023', 'product2', '200', 'delhi')
(3, '13-04-2023', 'product3', '300', 'ghaziabad')
(4, '14-04-2023', 'product4', '400', 'kanpur')
(5, '15-04-2023', 'product5', '500', 'meerut')